# Hamoye Stage A Tag-along Project

### By: Ajibade Abdulquddus Adedayo
### Hamoye ID: 147dd14b8b01f000
### Email: ajiscomorac@gmail.com

In [1]:
#Importing useful libraries and packages

import pandas as pd
import numpy as np
import math

In [261]:
#Question 1
# Creating a pandas DataFrame using a given list

lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]
col = ['Age','Nationality','Overall']
pd.DataFrame(lst, columns = col)
# or pd.DataFrame(lst, columns = col, index = [1,2,3])
# or pd.DataFrame(lst, columns = col, index = [i for i in range(1,4)])

   Age Nationality  Overall
0   35    Portugal       94
1   33   Argentina       93
2   30      Brazil       92

In [4]:
#Question 2
# Selecting a matrix from an array

array = np.array([[94, 89, 63],
           [93, 92, 48],
           [92, 94, 56]])
array[:2,1:]

array([[89, 63],
       [92, 48]])

In [5]:
#Question 5
#List Comprehension

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [6]:
#Question 6
# Type Error
my_tuppy = (1,2,5,8)
my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

In [7]:
#Question 7
#Assigning an element from a list to a variable x

y = [(2, 4), (7, 8), (1, 5, 9)]
x = y[1][1]
x

8

## Explorative Data Analysis (EDA)

**Analysis of a given Data Set (Food Balance Sheet)**

In [284]:
# Head of the Dataset (Dataset read from Notebook Location)

df= pd.read_csv('FoodBalanceSheets.csv', encoding='latin-1' )
df.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [267]:
#Question 11
# Finding the total sum of Animal Fat produced in 2014 and 2017 respectively

df.groupby('Item').sum().loc[['Animal fats'],['Y2014','Y2017']]

                 Y2014      Y2017
Item
Animal fats  209460.54  269617.53

In [269]:
#Question 12
# Finding  the mean and standard deviation across the whole dataset
# for the year 2015 to 3 decimal places

import math

round(df.describe().loc[['mean','std'], ['Y2015']], 3)

         Y2015
mean   135.236
std   1603.404

In [11]:
#Question 13 Total Number
# Finding the total number of missing data in 2016 to 2 decimal places

missing= df['Y2016'].isnull().sum()
missing

1535

In [18]:
#Question 13 Percentage
# Finding the percentage of missing data in 2016 to 2 decimal places

whole= df['Y2016'].sum()
percentage= missing/whole*100
round(percentage,2)

0.02

In [278]:
#Question 14
# Getting the year that had the highest correlation with â€˜Element Code'

years= ['Y2014', 'Y2015', 'Y2016','Y2017', 'Y2018']
c=df.corr().abs()
s=c.unstack()
so=s.sort_values(kind='quicksort')
print(so['Element Code'][years].idxmax())

Y2014

In [280]:
#Question 15
# Getting the year that has the highest sum of Import Quantity

df.groupby('Element').sum().loc[['Import Quantity'],years].idxmax(axis=1).reset_index(drop=True)

0    Y2017
dtype: object

In [120]:
#Question 16
# Finding the total number of the sum of Production in 2014

round(df.groupby('Element').sum().loc['Production']['Y2014'], 2)

1931287.75

In [282]:
#Question 17
#  Finding the Element that had the highest sum in 2018

print(df.groupby('Element').sum()['Y2018'].idxmax())

Domestic supply quantity

In [283]:
#Question 18
# Finding the Element that had the 3rd lowest sum in 2018

print(df.groupby('Element').sum()['Y2018'].nsmallest(3).idxmax())

Protein supply quantity (g/capita/day)

In [248]:
#Question 19
# Finding the total Import Quantity in Algeria in 2018

df.groupby(['Element', 'Area']).sum().loc[['Import Quantity']]['Y2018'].reset_index()[['Area','Y2018']].iloc[[0]]

      Area     Y2018
0  Algeria  36238.29

In [260]:
#Question 20
# Finding the total number of unique countries in the dataset

df.groupby('Area').nunique().sum()['Area']

49